app/views/products/index.html.erb

<script type="text/javascript" charset="utf-8">
$(function() {
  $(".js-more").on("click", function() {
    var id = $(this).data("id");
    $.get("/products/" + id + ".json", function(data) {
      var inventoryText = "<strong>Available</strong>";
      if(data["inventory"] === 0){
        inventoryText = "<strong>Sold Out</strong>";
      }
      var descriptionText = "<p>" + data["description"] + "</p><p>" + inventoryText + "</p>";
      $("#product-" + id).html(descriptionText);
      var ordersInfo = data["ordered_products"];
      for (var i = 0; i < ordersInfo.length; i++) {
        $("#product-" + id).append(data["name"] + " at " + ordersInfo[i]["created_at"]);
      }
    })
    // $.get("/products/" + id + "/description", function(description) {
    //   $.get("/products/" + id + "/inventory", function(inventory) {
    //     var inventoryText = "<strong>Available</strong>";
    //     if(inventory === "false"){
    //       inventoryText = "<strong>Sold Out</strong>";
    //     }
---
SELECT "products".* FROM "products"